---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoublePrepdepth
source: html/a8f2a5f0-9e31-d012-7deb-03bdefc09772.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoublePrepdepth Property

"Double Preparation Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldDoublePrepdepth { get; }
```